In [1]:
pwd

'C:\\Users\\DERANGULA ASRITHA'

In [2]:
import pandas as pd
df=pd.DataFrame([[1,2,3],[4,5,6]],columns=["A","B","C"],index=["A","B"])
df

   A  B  C
A  1  2  3
B  4  5  6

In [3]:
import pandas as pd
df=pd.DataFrame([[1,2,3],[4,5,6]],columns="A B C".split(),index="A B".split())
df

   A  B  C
A  1  2  3
B  4  5  6

In [4]:
df.shape  # it gives result as number of rows and columns count

(2, 3)

In [5]:
df.columns

Index(['A', 'B', 'C'], dtype='object')

In [6]:
df.index

Index(['A', 'B'], dtype='object')

In [7]:
df.values

array([[1, 2, 3],
       [4, 5, 6]], dtype=int64)

In [8]:
# 1.Dictionary of list
data={"ID":[113,112,114]
      ,"Name":["priya","nitya","sanjana"],
      "Score":[80,90,70]
      }
df=pd.DataFrame(data)
df

    ID     Name  Score
0  113    priya     80
1  112    nitya     90
2  114  sanjana     70

In [9]:
# 2. List of Tuples
d=[(1,"priya",80),
   (2,"nitya",90),
   (3,"sanjana",70)]
df1=pd.DataFrame(d,columns=["ID","Name","Score"])
df1

   ID     Name  Score
0   1    priya     80
1   2    nitya     90
2   3  sanjana     70

In [10]:
# pd Series
data3={"ID":pd.Series([113,112,114])
      ,"Name":pd.Series(["priya","nitya","sanjana"]),
      "Score":pd.Series([80,90,70])
      }
df3=pd.DataFrame(data3)
df3

    ID     Name  Score
0  113    priya     80
1  112    nitya     90
2  114  sanjana     70

In [11]:
import numpy as np
import pandas as pd
df=pd.DataFrame(np.random.randint(0,10,(5,5)),columns='p1 p2 p3 p4 p5'.split(),index='s1 s2 s3 s4 s5'.split())
df

    p1  p2  p3  p4  p5
s1   2   8   0   0   9
s2   2   3   5   0   5
s3   8   9   7   5   8
s4   4   0   0   8   8
s5   4   9   3   8   9

In [13]:
import pandas as pd
df = pd.read_csv("C:/Users/DERANGULA ASRITHA/Downloads/Copy of Sample - Superstore.csv - Orders.csv")
print(df.head())

   Row ID        Order ID  Order Date   Ship Date       Ship Mode Customer ID  \
0    2698  CA-2016-145317   3/18/2016   3/23/2016  Standard Class    SM-20320
1    6827  CA-2018-118689   10/2/2018   10/9/2018  Standard Class    TC-20980
2    8154  CA-2019-140151   3/23/2019   3/25/2019     First Class    RB-19360
3    2624  CA-2019-127180  10/22/2019  10/24/2019     First Class    TA-21385
4    4191  CA-2019-166709  11/17/2019  11/22/2019  Standard Class    HL-15040

  Customer Name      Segment Country/Region           City  ... Postal Code  \
0   Sean Miller  Home Office  United States   Jacksonville  ...     32216.0
1  Tamara Chand    Corporate  United States      Lafayette  ...     47905.0
2  Raymond Buch     Consumer  United States        Seattle  ...     98115.0
3  Tom Ashbrook  Home Office  United States  New York City  ...     10024.0
4  Hunter Lopez     Consumer  United States         Newark  ...     19711.0

          Region       Product ID    Category Sub-Category  \
0  South Updated  TEC-MA-10002412  Technology     Machines
1        Central  TEC-CO-10004722  Technology      Copiers
2           West  TEC-CO-10004722  Technology      Copiers
3           East  TEC-CO-10004722  Technology      Copiers
4           East  TEC-CO-10004722  Technology      Copiers

                                        Product Name      Sales  Quantity  \
0  Cisco TelePresence System EX90 Videoconferenci...  22638.480         6
1              Canon imageCLASS 2200 Advanced Copier  17499.950         5
2              Canon imageCLASS 2200 Advanced Copier  13999.960         4
3              Canon imageCLASS 2200 Advanced Copier  11199.968         4
4              Canon imageCLASS 2200 Advanced Copier  10499.970         3

   Discount     Profit
0       0.5 -1811.0784
1       0.0  8399.9760
2       0.0  6719.9808
3       0.2  3919.9888
4       0.0  5039.9856

[5 rows x 21 columns]

In [14]:
df.head()

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country/Region,City,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
0,2698,CA-2016-145317,3/18/2016,3/23/2016,Standard Class,SM-20320,Sean Miller,Home Office,United States,Jacksonville,...,32216.0,South Updated,TEC-MA-10002412,Technology,Machines,Cisco TelePresence System EX90 Videoconferenci...,22638.480,6,0.5,-1811.0784
1,6827,CA-2018-118689,10/2/2018,10/9/2018,Standard Class,TC-20980,Tamara Chand,Corporate,United States,Lafayette,...,47905.0,Central,TEC-CO-10004722,Technology,Copiers,Canon imageCLASS 2200 Advanced Copier,17499.950,5,0.0,8399.9760
2,8154,CA-2019-140151,3/23/2019,3/25/2019,First Class,RB-19360,Raymond Buch,Consumer,United States,Seattle,...,98115.0,West,TEC-CO-10004722,Technology,Copiers,Canon imageCLASS 2200 Advanced Copier,13999.960,4,0.0,6719.9808
3,2624,CA-2019-127180,10/22/2019,10/24/2019,First Class,TA-21385,Tom Ashbrook,Home Office,United States,New York City,...,10024.0,East,TEC-CO-10004722,Technology,Copiers,Canon imageCLASS 2200 Advanced Copier,11199.968,4,0.2,3919.9888
4,4191,CA-2019-166709,11/17/2019,11/22/2019,Standard Class,HL-15040,Hunter Lopez,Consumer,United States,Newark,...,19711.0,East,TEC-CO-10004722,Technology,Copiers,Canon imageCLASS 2200 Advanced Copier,10499.970,3,0.0,5039.9856

In [15]:
df.columns

Index(['Row ID', 'Order ID', 'Order Date', 'Ship Date', 'Ship Mode',
       'Customer ID', 'Customer Name', 'Segment', 'Country/Region', 'City',
       'State', 'Postal Code', 'Region', 'Product ID', 'Category',
       'Sub-Category', 'Product Name', 'Sales', 'Quantity', 'Discount',
       'Profit'],
      dtype='object')

In [16]:
df.shape

(9994, 21)

In [17]:
df.index

RangeIndex(start=0, stop=9994, step=1)

In [18]:
df.iloc[0:2,0:3] #retriving particular rows and columns

   Row ID        Order ID Order Date
0    2698  CA-2016-145317  3/18/2016
1    6827  CA-2018-118689  10/2/2018

In [19]:
df[['Order ID','Sales','Order Date']].head()  # .head() gives output as first 5 rows

         Order ID      Sales  Order Date
0  CA-2016-145317  22638.480   3/18/2016
1  CA-2018-118689  17499.950   10/2/2018
2  CA-2019-140151  13999.960   3/23/2019
3  CA-2019-127180  11199.968  10/22/2019
4  CA-2019-166709  10499.970  11/17/2019

In [20]:
df[['Order ID','Sales','Order Date']].tail()  # .tail() gives output as last 5 rows

            Order ID  Sales Order Date
9989  US-2016-152723  0.876  9/26/2016
9990  CA-2016-112403  0.852  3/31/2016
9991  CA-2018-168361  0.836  6/21/2018
9992  CA-2019-124114  0.556   3/2/2019
9993  US-2019-102288  0.444  6/19/2019

In [21]:
import pandas as pd

customers = pd.DataFrame({
    "CustomerID": [1, 2, 3, 4, 5],
    "Name": ["Aarav", "Priya", "Vikram", "Meera", "Sanjay"],
    "City": ["Delhi", "Mumbai", "Bangalore", "Chennai", "Hyderabad"]
})
print(customers)

   CustomerID    Name       City
0           1   Aarav      Delhi
1           2   Priya     Mumbai
2           3  Vikram  Bangalore
3           4   Meera    Chennai
4           5  Sanjay  Hyderabad

In [22]:
orders = pd.DataFrame({
    "OrderID": [101, 102, 103, 104, 105],
    "CustomerID": [3, 4, 5, 6, 7],
    "Product": ["Laptop", "Phone", "Tablet", "Camera", "Printer"]
})
orders

   OrderID  CustomerID  Product
0      101           3   Laptop
1      102           4    Phone
2      103           5   Tablet
3      104           6   Camera
4      105           7  Printer

In [23]:
customers

   CustomerID    Name       City
0           1   Aarav      Delhi
1           2   Priya     Mumbai
2           3  Vikram  Bangalore
3           4   Meera    Chennai
4           5  Sanjay  Hyderabad

In [24]:
orders

   OrderID  CustomerID  Product
0      101           3   Laptop
1      102           4    Phone
2      103           5   Tablet
3      104           6   Camera
4      105           7  Printer

In [25]:
inner=pd.merge(customers,orders,on='CustomerID',how='inner')
inner

   CustomerID    Name       City  OrderID Product
0           3  Vikram  Bangalore      101  Laptop
1           4   Meera    Chennai      102   Phone
2           5  Sanjay  Hyderabad      103  Tablet

In [26]:
import pandas as pd

customers = pd.DataFrame({
    "CustomerID": [1, 2, 3, 3, 5],
    "Name": ["Aarav", "Priya", "Vikram", "Meera", "Sanjay"],
    "City": ["Delhi", "Mumbai", "Bangalore", "Chennai", "Hyderabad"]
})
print(customers)

   CustomerID    Name       City
0           1   Aarav      Delhi
1           2   Priya     Mumbai
2           3  Vikram  Bangalore
3           3   Meera    Chennai
4           5  Sanjay  Hyderabad

In [27]:
orders = pd.DataFrame({
    "OrderID": [101, 102, 103, 104, 105],
    "CustomerID": [3, 4, 3, 6, 5],
    "Product": ["Laptop", "Phone", "Tablet", "Camera", "Printer"]
})
orders

   OrderID  CustomerID  Product
0      101           3   Laptop
1      102           4    Phone
2      103           3   Tablet
3      104           6   Camera
4      105           5  Printer

In [28]:
inner=pd.merge(customers,orders,on='CustomerID',how='inner')
inner

   CustomerID    Name       City  OrderID  Product
0           3  Vikram  Bangalore      101   Laptop
1           3  Vikram  Bangalore      103   Tablet
2           3   Meera    Chennai      101   Laptop
3           3   Meera    Chennai      103   Tablet
4           5  Sanjay  Hyderabad      105  Printer